eisup_2019_docmng_integration/src/Documents/абс_РазукрупнениеОСМ/абс_РазукрупнениеОСМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>абс_РазукрупнениеОСМ</name>
  <basedOn>Document.абс_РазукрупнениеОС</basedOn>
  <registerRecords>InformationRegister.ОсновныеСредстваМеждународныйУчет</registerRecords>
  <registerRecords>AccumulationRegister.абс_СтоимостьОСМеждународный</registerRecords>
  <registerRecords>AccountingRegister.Международный</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.абс_РазукрупнениеОС</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновноеСредство</name>
    <type>
      <types>CatalogRef.ОсновныеСредства</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОсновныеСредства</name>
    <attributes>
      <name>ОсновноеСредство</name>
      <type>
        <types>CatalogRef.ОсновныеСредства</types>
      </type>
    </attributes>
    <attributes>
      <name>Коэффициент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>10</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СчетЗатрат</name>
      <type>
        <types>ChartOfAccountsRef.Международный</types>
      </type>
    </attributes>
    <attributes>
      <name>Субконто1</name>
      <type>
        <types>Characteristic.ВидыСубконтоМеждународные</types>
      </type>
    </attributes>
    <attributes>
      <name>Субконто2</name>
      <type>
        <types>Characteristic.ВидыСубконтоМеждународные</types>
      </type>
    </attributes>
    <attributes>
      <name>Субконто3</name>
      <type>
        <types>Characteristic.ВидыСубконтоМеждународные</types>
      </type>
    </attributes>
    <attributes>
      <name>СчетСниженияСтоимости</name>
      <type>
        <types>ChartOfAccountsRef.Международный</types>
      </type>
    </attributes>
    <attributes>
      <name>Местонахождение</name>
      <type>
        <types>CatalogRef.ПодразделенияОрганизаций</types>
      </type>
    </attributes>
    <attributes>
      <name>МОЛ</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>КоэффициентУскорения</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НачислятьАмортизацию</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПринятияКУчету</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

eisup_2019_docmng_integration/src/InformationRegisters/ОсновныеСредстваМеждународныйУчет/ОсновныеСредстваМеждународныйУчет.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОсновныеСредстваМеждународныйУчет</name>
  <comment>(Упр) Сведения об объектах ОС  для целей международного учета</comment>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Организация</name>
    <comment>Организация, на балансе которой учитывется объект ОС в международном учете</comment>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </resources>
  <resources>
    <name>ДатаПринятияКУчету</name>
    <comment>Дата принятия объекта к международному учету</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>МестонахождениеОбъекта</name>
    <comment>Подразделение организации, в котором находится объект ОС</comment>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </resources>
  <resources>
    <name>МОЛ</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </resources>
  <resources>
    <name>Состояние</name>
    <type>
      <types>EnumRef.ВидыСостоянийОС</types>
    </type>
  </resources>
  <resources>
    <name>СчетУчета</name>
    <comment>Счет учета в плане счетов Международный</comment>
    <type>
      <types>ChartOfAccountsRef.Международный</types>
    </type>
  </resources>
  <resources>
    <name>СрокПолезногоИспользования</name>
    <comment>Срок полезного использования в месяцах</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НачислятьАмортизацию</name>
    <comment>Булево - начиляется амортизация или нет</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>МетодНачисленияАмортизации</name>
    <comment>Метод начисления амортизации по международному учету</comment>
    <type>
      <types>EnumRef.МетодыНачисленияАмортизацииОСМеждународный</types>
    </type>
  </resources>
  <resources>
    <name>СчетНачисленияАмортизации</name>
    <comment>Счет, на котором накапливается начисленная амортизация</comment>
    <type>
      <types>ChartOfAccountsRef.Международный</types>
    </type>
  </resources>
  <resources>
    <name>ПервоначальнаяСтоимость</name>
    <comment>Первоначальная (историческая) стоимость объекта</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>13</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СправедливаяСтоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>13</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЛиквидационнаяСтоимость</name>
    <comment>Стоимость, которая должна остаться после истечения срока полезного использования</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>13</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СчетЗатрат</name>
    <comment>Счет учета, в дебет которого относятся амортизационные отчисления</comment>
    <type>
      <types>ChartOfAccountsRef.Международный</types>
    </type>
  </resources>
  <resources>
    <name>Субконто1</name>
    <comment>Субконто первого уровня счета, в дебет которого относится амортизация</comment>
    <type>
      <types>Characteristic.ВидыСубконтоМеждународные</types>
    </type>
  </resources>
  <resources>
    <name>Субконто2</name>
    <comment>Субконто второго уровня счета, в дебет которого относится амортизация</comment>
    <type>
      <types>Characteristic.ВидыСубконтоМеждународные</types>
    </type>
  </resources>
  <resources>
    <name>Субконто3</name>
    <comment>Субконто третьего уровня счета, в дебет которого относится амортизация</comment>
    <type>
      <types>Characteristic.ВидыСубконтоМеждународные</types>
    </type>
  </resources>
  <resources>
    <name>ПредполагаемыйОбъемПродукции</name>
    <comment>Используется при амортизации пропорционально объему продукции</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаНачисленнойАмортизации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>13</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>УбытокОтОбесценения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоэффициентУскорения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СчетСниженияСтоимости</name>
    <type>
      <types>ChartOfAccountsRef.Международный</types>
    </type>
  </resources>
  <dimensions>
    <name>ОсновноеСредство</name>
    <type>
      <types>CatalogRef.ОсновныеСредства</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

eisup_2019_docmng_integration/src/AccumulationRegisters/абс_СтоимостьОСМеждународный/абс_СтоимостьОСМеждународный.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>абс_СтоимостьОСМеждународный</name>
  <resources>
    <name>Стоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Амортизация</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ОсновноеСредство</name>
    <type>
      <types>CatalogRef.ОсновныеСредства</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

eisup_2019_docmng_integration/src/InformationRegisters/СоответствиеСчетовБУиМСФО/СоответствиеСчетовБУиМСФО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СоответствиеСчетовБУиМСФО</name>
  <comment>(Упр)</comment>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>СчетМеждународный</name>
    <type>
      <types>ChartOfAccountsRef.Международный</types>
    </type>
  </resources>
  <resources>
    <name>СубконтоМежд1</name>
    <type>
      <types>Characteristic.ВидыСубконтоМеждународные</types>
    </type>
  </resources>
  <resources>
    <name>СубконтоМежд2</name>
    <type>
      <types>Characteristic.ВидыСубконтоМеждународные</types>
    </type>
  </resources>
  <resources>
    <name>СубконтоМежд3</name>
    <type>
      <types>Characteristic.ВидыСубконтоМеждународные</types>
    </type>
  </resources>
  <resources>
    <name>Учитывается</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитПредставление</name>
    <comment>Пользовательское представление реквизита</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Приоритет</name>
    <type>
      <types>EnumRef.ПриоритетПравилПереносаСчетов</types>
    </type>
  </attributes>
  <dimensions>
    <name>СчетХозрасчетный</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидДвижения</name>
    <type>
      <types>EnumRef.ВидыДвиженийБухгалтерии</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СубконтоХозр1</name>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СубконтоХозр2</name>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СубконтоХозр3</name>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Реквизит</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Значение</name>
    <type>
      <types>Boolean</types>
      <types>String</types>
      <types>Date</types>
      <types>Number</types>
      <types>AnyRef</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

eisup_2019_docmng_integration/src/Enums/СостоянияОС/СостоянияОС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостоянияОС</name>
  <comment>Состояния ОС</comment>
  <enumValues>
    <name>ПринятоКУчету</name>
    <comment>Принято к учету</comment>
  </enumValues>
  <enumValues>
    <name>ВведеноВЭксплуатацию</name>
    <comment>Введено в эксплуатацию</comment>
  </enumValues>
  <enumValues>
    <name>СнятоСУчета</name>
    <comment>Снято с учета</comment>
  </enumValues>
</mdclass:Enum>

eisup_2019_docmng_integration/src/Documents/абс_РазукрупнениеОСМ/ManagerModule.bsl
Функция ПолучитьСтруктуруЗапросовПроведения() Экспорт

	СтруктураЗапросов = Новый Структура;
	ДобавитьОбщиеЗапросы(СтруктураЗапросов);
	ДобавитьЗапросыДляРазукрупнения(СтруктураЗапросов);
	
	Возврат СтруктураЗапросов;

КонецФункции

Процедура ДобавитьЗапросыДляРазукрупнения(СтруктураЗапросов)

	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ПериодыРегистраторыСреза.Период,
		|	ПериодыРегистраторыСреза.Регистратор,
		|	ПериодыРегистраторыСреза.ОсновноеСредство КАК ОсновноеСредство,
		|	ОсновныеСредстваМеждународныйУчет.Организация,
		|	ОсновныеСредстваМеждународныйУчет.ДатаПринятияКУчету,
		|	ОсновныеСредстваМеждународныйУчет.МестонахождениеОбъекта,
		|	ОсновныеСредстваМеждународныйУчет.МОЛ,
		|	ОсновныеСредстваМеждународныйУчет.Состояние,
		|	ОсновныеСредстваМеждународныйУчет.СчетУчета,
		|	ОсновныеСредстваМеждународныйУчет.СрокПолезногоИспользования,
		|	ОсновныеСредстваМеждународныйУчет.НачислятьАмортизацию,
		|	ОсновныеСредстваМеждународныйУчет.МетодНачисленияАмортизации,
		|	ОсновныеСредстваМеждународныйУчет.СчетНачисленияАмортизации,
		|	ОсновныеСредстваМеждународныйУчет.ПервоначальнаяСтоимость,
		|	ОсновныеСредстваМеждународныйУчет.СправедливаяСтоимость,
		|	ОсновныеСредстваМеждународныйУчет.ЛиквидационнаяСтоимость,
		|	ОсновныеСредстваМеждународныйУчет.СчетЗатрат,
		|	ОсновныеСредстваМеждународныйУчет.Субконто1,
		|	ОсновныеСредстваМеждународныйУчет.Субконто2,
		|	ОсновныеСредстваМеждународныйУчет.Субконто3,
		|	ОсновныеСредстваМеждународныйУчет.ПредполагаемыйОбъемПродукции,
		|	ОсновныеСредстваМеждународныйУчет.СуммаНачисленнойАмортизации,
		|	ОсновныеСредстваМеждународныйУчет.УбытокОтОбесценения,
		|	ОсновныеСредстваМеждународныйУчет.КоэффициентУскорения,
		|	ОсновныеСредстваМеждународныйУчет.СчетСниженияСтоимости
		|ПОМЕСТИТЬ ПараметрыОсновногоСредства
		|ИЗ
		|	(ВЫБРАТЬ
		|		ПериодыСреза.ОсновноеСредство КАК ОсновноеСредство,
		|		ПериодыСреза.Период КАК Период,
		|		МАКСИМУМ(ОсновныеСредстваМеждународныйУчет.Регистратор) КАК Регистратор
		|	ИЗ
		|		(ВЫБРАТЬ
		|			ОсновныеСредстваМеждународныйУчет.ОсновноеСредство КАК ОсновноеСредство,
		|			МАКСИМУМ(ОсновныеСредстваМеждународныйУчет.Период) КАК Период
		|		ИЗ
		|			РегистрСведений.ОсновныеСредстваМеждународныйУчет КАК ОсновныеСредстваМеждународныйУчет
		|		ГДЕ
		|			ОсновныеСредстваМеждународныйУчет.ОсновноеСредство = &ОсновноеСредство
		|			И ОсновныеСредстваМеждународныйУчет.Период <= &Период
		|			И ОсновныеСредстваМеждународныйУчет.Активность
		|		
		|		СГРУППИРОВАТЬ ПО
		|			ОсновныеСредстваМеждународныйУчет.ОсновноеСредство) КАК ПериодыСреза
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОсновныеСредстваМеждународныйУчет КАК ОсновныеСредстваМеждународныйУчет
		|			ПО ПериодыСреза.ОсновноеСредство = ОсновныеСредстваМеждународныйУчет.ОсновноеСредство
		|				И ПериодыСреза.Период = ОсновныеСредстваМеждународныйУчет.Период
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ПериодыСреза.ОсновноеСредство,
		|		ПериодыСреза.Период) КАК ПериодыРегистраторыСреза
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОсновныеСредстваМеждународныйУчет КАК ОсновныеСредстваМеждународныйУчет
		|		ПО ПериодыРегистраторыСреза.Период = ОсновныеСредстваМеждународныйУчет.Период
		|			И ПериодыРегистраторыСреза.Регистратор = ОсновныеСредстваМеждународныйУчет.Регистратор
		|			И ПериодыРегистраторыСреза.ОсновноеСредство = ОсновныеСредстваМеждународныйУчет.ОсновноеСредство
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ОсновноеСредство";
	
	СтруктураЗапросов.Вставить("абс_ВнеоборотныеАктивы_ТекстЗапросаОсновныеСредстваМСФОПоОдномуОС", ТекстЗапроса+";");
	
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	абс_РазукрупнениеОСМ.Ссылка,
		|	абс_РазукрупнениеОСМ.Номер,
		|	абс_РазукрупнениеОСМ.Дата,
		|	абс_РазукрупнениеОСМ.Организация,
		|	абс_РазукрупнениеОСМ.ДокументОснование,
		|	абс_РазукрупнениеОСМ.ОсновноеСредство
		|ПОМЕСТИТЬ Шапкадокумента
		|ИЗ
		|	Документ.абс_РазукрупнениеОСМ КАК абс_РазукрупнениеОСМ
		|ГДЕ
		|	абс_РазукрупнениеОСМ.Ссылка = &Ссылка";
	
	СтруктураЗапросов.Вставить("Разукрупнение_ТекстЗапросаШапкаДокумента", ТекстЗапроса+";");
	
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	абс_РазукрупнениеОСМОсновныеСредства.НомерСтроки,
		|	абс_РазукрупнениеОСМОсновныеСредства.ОсновноеСредство,
		|	абс_РазукрупнениеОСМОсновныеСредства.Коэффициент,
		|	ПараметрыОсновногоСредства.СчетУчета,
		|	ПараметрыОсновногоСредства.СчетНачисленияАмортизации,
		|	абс_РазукрупнениеОСМОсновныеСредства.СчетЗатрат,
		|	абс_РазукрупнениеОСМОсновныеСредства.Субконто1,
		|	абс_РазукрупнениеОСМОсновныеСредства.Субконто2,
		|	абс_РазукрупнениеОСМОсновныеСредства.Субконто3,
		|	абс_РазукрупнениеОСМОсновныеСредства.СчетСниженияСтоимости,
		|	абс_РазукрупнениеОСМОсновныеСредства.Местонахождение,
		|	абс_РазукрупнениеОСМОсновныеСредства.МОЛ,
		|	абс_РазукрупнениеОСМОсновныеСредства.КоэффициентУскорения,
		|	абс_РазукрупнениеОСМОсновныеСредства.НачислятьАмортизацию,
		|	ПараметрыОсновногоСредства.СрокПолезногоИспользования,
		|	ПараметрыОсновногоСредства.ДатаПринятияКУчету,
		|	абс_РазукрупнениеОСМОсновныеСредства.ОсновноеСредство.ГруппаОС КАК ГруппаОС,
		|	абс_РазукрупнениеОСМОсновныеСредства.ОсновноеСредство.ЦельИспользования КАК ЦельИспользования
		|ПОМЕСТИТЬ ТабличнаяЧастьОсновныеСредства
		|ИЗ
		|	Документ.абс_РазукрупнениеОСМ.ОсновныеСредства КАК абс_РазукрупнениеОСМОсновныеСредства,
		|	ПараметрыОсновногоСредства КАК ПараметрыОсновногоСредства
		|ГДЕ
		|	абс_РазукрупнениеОСМОсновныеСредства.Ссылка = &Ссылка";
	
	СтруктураЗапросов.Вставить("Разукрупнение_ТекстЗапросаТабличнаяЧастьОсновныеСредства", ТекстЗапроса+";");
	
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	абс_СтоимостьОСМеждународныйОстатки.ОсновноеСредство,
		|	абс_СтоимостьОСМеждународныйОстатки.СтоимостьОстаток КАК Стоимость,
		|	абс_СтоимостьОСМеждународныйОстатки.АмортизацияОстаток КАК Амортизация
		|ПОМЕСТИТЬ СтоимостьСтарогоОсновногоСредства
		|ИЗ
		|	РегистрНакопления.абс_СтоимостьОСМеждународный.Остатки(
		|			&МоментДокумента,
		|			ОсновноеСредство = &ОсновноеСредство
		|				И Организация = &Организация) КАК абс_СтоимостьОСМеждународныйОстатки";
	
	СтруктураЗапросов.Вставить("Разукрупнение_ТекстЗапросаСтоимостьСтарогоОсновногоСредства", ТекстЗапроса+";");
	
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ТабличнаяЧастьОсновныеСредства.НомерСтроки КАК НомерСтроки,
		|	ТабличнаяЧастьОсновныеСредства.ОсновноеСредство,
		|	ВЫРАЗИТЬ(СтоимостьСтарогоОсновногоСредства.Стоимость * ТабличнаяЧастьОсновныеСредства.Коэффициент КАК ЧИСЛО(15, 2)) КАК Стоимость,
		|	ВЫРАЗИТЬ(СтоимостьСтарогоОсновногоСредства.Амортизация * ТабличнаяЧастьОсновныеСредства.Коэффициент КАК ЧИСЛО(15, 2)) КАК Амортизация
		|ПОМЕСТИТЬ РаспределениеСтоимости
		|ИЗ
		|	ТабличнаяЧастьОсновныеСредства КАК ТабличнаяЧастьОсновныеСредства,
		|	СтоимостьСтарогоОсновногоСредства КАК СтоимостьСтарогоОсновногоСредства
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	НомерСтроки";
	
	СтруктураЗапросов.Вставить("Разукрупнение_ТекстЗапросаРаспределениеСтоимости", ТекстЗапроса+";");
	
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	СтоимостьСтарогоОсновногоСредства.Стоимость - ЕСТЬNULL(ВложенныйЗапрос.Стоимость, 0) КАК Стоимость,
		|	СтоимостьСтарогоОсновногоСредства.Амортизация - ЕСТЬNULL(ВложенныйЗапрос.Амортизация, 0) КАК Амортизация
		|ПОМЕСТИТЬ НераспределеннаяСтоимость
		|ИЗ
		|	СтоимостьСтарогоОсновногоСредства КАК СтоимостьСтарогоОсновногоСредства
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			СУММА(РаспределениеСтоимости.Стоимость) КАК Стоимость,
		|			СУММА(РаспределениеСтоимости.Амортизация) КАК Амортизация
		|		ИЗ
		|			РаспределениеСтоимости КАК РаспределениеСтоимости) КАК ВложенныйЗапрос
		|		ПО (ИСТИНА)";
	
	СтруктураЗапросов.Вставить("Разукрупнение_ТекстЗапросаНераспределеннаяСтоимость", ТекстЗапроса+";");
	
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	РаспределениеСтоимости.НомерСтроки КАК НомерСтроки,
		|	РаспределениеСтоимости.ОсновноеСредство,
		|	РаспределениеСтоимости.Стоимость + ЕСТЬNULL(НераспределеннаяСтоимость.Стоимость, 0) КАК Стоимость,
		|	РаспределениеСтоимости.Амортизация + ЕСТЬNULL(НераспределеннаяСтоимость.Амортизация, 0) КАК Амортизация
		|ПОМЕСТИТЬ СтоимостьНовыхОсновныхСредств
		|ИЗ
		|	РаспределениеСтоимости КАК РаспределениеСтоимости
		|		ЛЕВОЕ СОЕДИНЕНИЕ НераспределеннаяСтоимость КАК НераспределеннаяСтоимость
		|		ПО (РаспределениеСтоимости.НомерСтроки = 1)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	НомерСтроки";
	
	СтруктураЗапросов.Вставить("Разукрупнение_ТекстЗапросаСтоимостьНовыхОсновныхСредств", ТекстЗапроса+";");
	
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	&Период,
		|	ПараметрыОсновногоСредства.ОсновноеСредство,
		|	ПараметрыОсновногоСредства.Организация,
		|	ПараметрыОсновногоСредства.ДатаПринятияКУчету,
		|	ПараметрыОсновногоСредства.МестонахождениеОбъекта,
		|	ПараметрыОсновногоСредства.МОЛ,
		|	ЗНАЧЕНИЕ(Перечисление.СостоянияОС.СнятоСУчета) КАК Состояние,
		|	ПараметрыОсновногоСредства.СчетУчета,
		|	ПараметрыОсновногоСредства.СрокПолезногоИспользования,
		|	ЛОЖЬ КАК НачислятьАмортизацию,
		|	ПараметрыОсновногоСредства.МетодНачисленияАмортизации,
		|	ПараметрыОсновногоСредства.СчетНачисленияАмортизации,
		|	ПараметрыОсновногоСредства.ПервоначальнаяСтоимость,
		|	0 КАК СправедливаяСтоимость,
		|	ПараметрыОсновногоСредства.ЛиквидационнаяСтоимость,
		|	ПараметрыОсновногоСредства.СчетЗатрат,
		|	ПараметрыОсновногоСредства.Субконто1,
		|	ПараметрыОсновногоСредства.Субконто2,
		|	ПараметрыОсновногоСредства.Субконто3,
		|	ПараметрыОсновногоСредства.ПредполагаемыйОбъемПродукции,
		|	0 КАК СуммаНачисленнойАмортизации,
		|	ПараметрыОсновногоСредства.УбытокОтОбесценения,
		|	ПараметрыОсновногоСредства.КоэффициентУскорения,
		|	ПараметрыОсновногоСредства.СчетСниженияСтоимости
		|ИЗ
		|	ПараметрыОсновногоСредства КАК ПараметрыОсновногоСредства
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	&Период,
		|	ТабличнаяЧастьОсновныеСредства.ОсновноеСредство,
		|	&Организация,
		|	ТабличнаяЧастьОсновныеСредства.ДатаПринятияКУчету,
		|	ТабличнаяЧастьОсновныеСредства.Местонахождение,
		|	ТабличнаяЧастьОсновныеСредства.МОЛ,
		|	ЗНАЧЕНИЕ(Перечисление.СостоянияОС.ВведеноВЭксплуатацию),
		|	ТабличнаяЧастьОсновныеСредства.СчетУчета,
		|	ВЫБОР
		|		КОГДА ТабличнаяЧастьОсновныеСредства.СрокПолезногоИспользования = 0
		|			ТОГДА ПараметрыОсновногоСредства.СрокПолезногоИспользования
		|		ИНАЧЕ ТабличнаяЧастьОсновныеСредства.СрокПолезногоИспользования
		|	КОНЕЦ,
		|	ИСТИНА,
		|	ПараметрыОсновногоСредства.МетодНачисленияАмортизации,
		|	ТабличнаяЧастьОсновныеСредства.СчетНачисленияАмортизации,
		|	ВЫРАЗИТЬ(ПараметрыОсновногоСредства.ПервоначальнаяСтоимость * ТабличнаяЧастьОсновныеСредства.Коэффициент КАК ЧИСЛО(15, 2)),
		|	ВЫРАЗИТЬ(ПараметрыОсновногоСредства.СправедливаяСтоимость * ТабличнаяЧастьОсновныеСредства.Коэффициент КАК ЧИСЛО(15, 2)),
		|	ВЫРАЗИТЬ(ПараметрыОсновногоСредства.ЛиквидационнаяСтоимость * ТабличнаяЧастьОсновныеСредства.Коэффициент КАК ЧИСЛО(15, 2)),
		|	ТабличнаяЧастьОсновныеСредства.СчетЗатрат,
		|	ТабличнаяЧастьОсновныеСредства.Субконто1,
		|	ТабличнаяЧастьОсновныеСредства.Субконто2,
		|	ТабличнаяЧастьОсновныеСредства.Субконто3,
		|	ПараметрыОсновногоСредства.ПредполагаемыйОбъемПродукции,
		|	СтоимостьНовыхОсновныхСредств.Амортизация,
		|	ВЫРАЗИТЬ(ПараметрыОсновногоСредства.УбытокОтОбесценения * ТабличнаяЧастьОсновныеСредства.Коэффициент КАК ЧИСЛО(15, 2)),
		|	ВЫБОР
		|		КОГДА ТабличнаяЧастьОсновныеСредства.КоэффициентУскорения = 0
		|			ТОГДА 1
		|		ИНАЧЕ ТабличнаяЧастьОсновныеСредства.КоэффициентУскорения
		|	КОНЕЦ,
		|	ТабличнаяЧастьОсновныеСредства.СчетСниженияСтоимости
		|ИЗ
		|	ТабличнаяЧастьОсновныеСредства КАК ТабличнаяЧастьОсновныеСредства
		|		ЛЕВОЕ СОЕДИНЕНИЕ СтоимостьНовыхОсновныхСредств КАК СтоимостьНовыхОсновныхСредств
		|		ПО ТабличнаяЧастьОсновныеСредства.НомерСтроки = СтоимостьНовыхОсновныхСредств.НомерСтроки,
		|	ПараметрыОсновногоСредства КАК ПараметрыОсновногоСредства";
	
	СтруктураЗапросов.Вставить("Разукрупнение_ТекстЗапросаТаблица_ОсновныеСредстваМеждународныйУчет", ТекстЗапроса+";");
	
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	&Период КАК Период,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
		|	&Организация КАК Организация,
		|	СтоимостьСтарогоОсновногоСредства.ОсновноеСредство КАК ОсновноеСредство,
		|	-СтоимостьСтарогоОсновногоСредства.Стоимость КАК Стоимость,
		|	-СтоимостьСтарогоОсновногоСредства.Амортизация КАК Амортизация
		|ИЗ
		|	СтоимостьСтарогоОсновногоСредства КАК СтоимостьСтарогоОсновногоСредства
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	&Период,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
		|	&Организация,
		|	СтоимостьНовыхОсновныхСредств.ОсновноеСредство,
		|	СтоимостьНовыхОсновныхСредств.Стоимость,
		|	СтоимостьНовыхОсновныхСредств.Амортизация
		|ИЗ
		|	СтоимостьНовыхОсновныхСредств КАК СтоимостьНовыхОсновныхСредств";
	
	СтруктураЗапросов.Вставить("Разукрупнение_ТекстЗапросаТаблица_абс_СтоимостьОСМеждународный", ТекстЗапроса+";");
	
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	&Период,
		|	&Организация,
		|	ПараметрыОсновногоСредства.СчетУчета КАК СчетДт,
		|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоМеждународные.ОсновныеСредства) КАК ВидСубконтоДт1,
		|	СтоимостьСтарогоОсновногоСредства.ОсновноеСредство КАК СубконтоДт1,
		|	ЗНАЧЕНИЕ(ПланСчетов.Международный.Служебный) КАК СчетКт,
		|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоМеждународные.ПустаяСсылка) КАК ВидСубконтоКт1,
		|	НЕОПРЕДЕЛЕНО КАК СубконтоКт1,
		|	-СтоимостьСтарогоОсновногоСредства.Стоимость КАК Сумма,
		|	""Разукрупнение ОС"" КАК Содержание,
		|	Шапкадокумента.ДокументОснование КАК ПервичныйДокумент
		|ИЗ
		|	СтоимостьСтарогоОсновногоСредства КАК СтоимостьСтарогоОсновногоСредства,
		|	ПараметрыОсновногоСредства КАК ПараметрыОсновногоСредства,
		|	Шапкадокумента КАК Шапкадокумента
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	&Период,
		|	&Организация,
		|	ЗНАЧЕНИЕ(ПланСчетов.Международный.Служебный),
		|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоМеждународные.ПустаяСсылка),
		|	НЕОПРЕДЕЛЕНО,
		|	ПараметрыОсновногоСредства.СчетНачисленияАмортизации,
		|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоМеждународные.ОсновныеСредства),
		|	СтоимостьСтарогоОсновногоСредства.ОсновноеСредство,
		|	-СтоимостьСтарогоОсновногоСредства.Амортизация,
		|	""Разукрупнение ОС"",
		|	Шапкадокумента.ДокументОснование
		|ИЗ
		|	ПараметрыОсновногоСредства КАК ПараметрыОсновногоСредства,
		|	Шапкадокумента КАК Шапкадокумента,
		|	СтоимостьСтарогоОсновногоСредства КАК СтоимостьСтарогоОсновногоСредства
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	&Период,
		|	&Организация,
		|	ТабличнаяЧастьОсновныеСредства.СчетУчета,
		|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоМеждународные.ОсновныеСредства),
		|	ТабличнаяЧастьОсновныеСредства.ОсновноеСредство,
		|	ЗНАЧЕНИЕ(ПланСчетов.Международный.Служебный),
		|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоМеждународные.ПустаяСсылка),
		|	НЕОПРЕДЕЛЕНО,
		|	СтоимостьНовыхОсновныхСредств.Стоимость,
		|	""Разукрупнение ОС"",
		|	Шапкадокумента.ДокументОснование
		|ИЗ
		|	ТабличнаяЧастьОсновныеСредства КАК ТабличнаяЧастьОсновныеСредства
		|		ЛЕВОЕ СОЕДИНЕНИЕ СтоимостьНовыхОсновныхСредств КАК СтоимостьНовыхОсновныхСредств
		|		ПО ТабличнаяЧастьОсновныеСредства.НомерСтроки = СтоимостьНовыхОсновныхСредств.НомерСтроки,
		|	Шапкадокумента КАК Шапкадокумента
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	&Период,
		|	&Организация,
		|	ЗНАЧЕНИЕ(ПланСчетов.Международный.Служебный),
		|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоМеждународные.ПустаяСсылка),
		|	НЕОПРЕДЕЛЕНО,
		|	ТабличнаяЧастьОсновныеСредства.СчетНачисленияАмортизации,
		|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоМеждународные.ОсновныеСредства),
		|	СтоимостьНовыхОсновныхСредств.ОсновноеСредство,
		|	СтоимостьНовыхОсновныхСредств.Амортизация,
		|	""Разукрупнение ОС"",
		|	Шапкадокумента.ДокументОснование
		|ИЗ
		|	ТабличнаяЧастьОсновныеСредства КАК ТабличнаяЧастьОсновныеСредства
		|		ЛЕВОЕ СОЕДИНЕНИЕ СтоимостьНовыхОсновныхСредств КАК СтоимостьНовыхОсновныхСредств
		|		ПО ТабличнаяЧастьОсновныеСредства.НомерСтроки = СтоимостьНовыхОсновныхСредств.НомерСтроки,
		|	Шапкадокумента КАК Шапкадокумента";
	
	СтруктураЗапросов.Вставить("Разукрупнение_ТекстЗапросаТаблица_Международный", ТекстЗапроса+";");
	
	ТекстЗапроса = 
		"УНИЧТОЖИТЬ ПараметрыОсновногоСредства
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ Шапкадокумента
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ТабличнаяЧастьОсновныеСредства
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ СтоимостьСтарогоОсновногоСредства
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ РаспределениеСтоимости
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ НераспределеннаяСтоимость
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ СтоимостьНовыхОсновныхСредств";
	
	СтруктураЗапросов.Вставить("Разукрупнение_УдалениеВременныхТаблиц", ТекстЗапроса+";");
	
КонецПроцедуры

Процедура ДобавитьОбщиеЗапросы(СтруктураЗапросов)

	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	Международный.Ссылка КАК Счет,
		|	ЕСТЬNULL(ВидыСубконто1.ВидСубконто, ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоМеждународные.ПустаяСсылка)) КАК ВидСубконто1,
		|	ЕСТЬNULL(ВидыСубконто2.ВидСубконто, ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоМеждународные.ПустаяСсылка)) КАК ВидСубконто2,
		|	ЕСТЬNULL(ВидыСубконто3.ВидСубконто, ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоМеждународные.ПустаяСсылка)) КАК ВидСубконто3
		|ПОМЕСТИТЬ ВидыСубконтоСчетов
		|ИЗ
		|	ПланСчетов.Международный КАК Международный
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.Международный.ВидыСубконто КАК ВидыСубконто1
		|		ПО Международный.Ссылка = ВидыСубконто1.Ссылка
		|			И (ВидыСубконто1.НомерСтроки = 1)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.Международный.ВидыСубконто КАК ВидыСубконто2
		|		ПО Международный.Ссылка = ВидыСубконто2.Ссылка
		|			И (ВидыСубконто2.НомерСтроки = 2)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.Международный.ВидыСубконто КАК ВидыСубконто3
		|		ПО Международный.Ссылка = ВидыСубконто3.Ссылка
		|			И (ВидыСубконто3.НомерСтроки = 3)
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Счет";
		
	СтруктураЗапросов.Вставить("абс_МеждународныйУчет_ТекстЗапросаВидыСубконтоСчетов", ТекстЗапроса+";");
	
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	СоответствиеСчетовБУиМСФОСрезПоследних.СчетХозрасчетный КАК СчетХозрасчетный,
		|	СоответствиеСчетовБУиМСФОСрезПоследних.ВидДвижения КАК ВидДвижения,
		|	СоответствиеСчетовБУиМСФОСрезПоследних.СчетМеждународный
		|ПОМЕСТИТЬ СоответствиеСчетовХозрасчетныйМСФО
		|ИЗ
		|	РегистрСведений.СоответствиеСчетовБУиМСФО.СрезПоследних(
		|			&Период,
		|			СубконтоХозр1 В (&ПустыеСубконто)
		|				И СубконтоХозр2 В (&ПустыеСубконто)
		|				И СубконтоХозр3 В (&ПустыеСубконто)) КАК СоответствиеСчетовБУиМСФОСрезПоследних
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	СчетХозрасчетный,
		|	ВидДвижения";
		
	СтруктураЗапросов.Вставить("абс_МеждународныйУчет_ТекстЗапросаСоответствиеСчетовХозрасчетный", ТекстЗапроса+";");
	
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ВЫРАЗИТЬ(ТаблицаСроков.ГруппаОС КАК Перечисление.ГруппыОС) КАК ГруппаОС,
		|	ВЫРАЗИТЬ(ТаблицаСроков.ЦельИспользования КАК Справочник.ЦелиИспользования) КАК ЦельИспользования,
		|	ВЫРАЗИТЬ(ТаблицаСроков.СрокИспользования КАК ЧИСЛО(4, 0)) КАК СрокИспользования
		|ПОМЕСТИТЬ СрокиПолезногоИспользования
		|ИЗ
		|	&ТаблицаСроков КАК ТаблицаСроков
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ГруппаОС,
		|	ЦельИспользования";
		
	СтруктураЗапросов.Вставить("абс_МеждународныйУчет_ТекстЗапросаСрокиПолезногоИспользования", ТекстЗапроса+";");

КонецПроцедуры










/////////////////////////////////////////////////////////////////////////////////
// Программный интерфейс проведения документов

Процедура ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства, Отказ) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Период", Ссылка.Дата);
	Запрос.УстановитьПараметр("Организация", Ссылка.Организация);
	Запрос.УстановитьПараметр("МоментДокумента", Новый Граница(Ссылка.МоментВремени(), ВидГраницы.Исключая));
	
	ТекстыЗапросов = Новый СписокЗначений;
	//ТекстыЗапросов.Добавить(ТекстЗапросаШапкаДокумента(), "");
	//ТекстыЗапросов.Добавить(ТекстЗапросаОсновныеСредстваДокумента(), "");
	//ТекстыЗапросов.Добавить(абс_ВнеоборотныеАктивы.ТекстЗапроса_ОсновныеСредстваРЖДПоТаблицеОС("ОсновныеСредстваДокумента"), "");
	//ТекстыЗапросов.Добавить(ТекстЗапросаОстаткиСтоимостиОС(), "");
	//ТекстыЗапросов.Добавить(ТекстЗапросаСтоимостьКомплектации(), "");
	//
	//ТекстыЗапросов.Добавить(ТекстЗапросаТаблица_абс_ОсновныеСредстваРЖД(), "Таблица_абс_ОсновныеСредстваРЖД");
	//ТекстыЗапросов.Добавить(ТекстЗапросаТаблица_абс_СтоимостьОСРЖД(), "Таблица_абс_СтоимостьОСРЖД");
	//ТекстыЗапросов.Добавить(ТекстЗапросаТаблица_абс_МеждународныйОСРЖД(), "Таблица_абс_МеждународныйОСРЖД");
	
	абс_ПроведениеДокументов.ИницализироватьТаблицыДляДвижений(Запрос, ТекстыЗапросов, ДополнительныеСвойства.ТаблицыДляДвижений);
	
КонецПроцедуры


/////////////////////////////////////////////////////////////////////////////////
// Функции, возвращающие тексты запросов для инициализации данных документа

Функция ТекстЗапросаШапкаДокумента()
	
	Возврат "";
	
КонецФункции

Функция ТекстЗапросаТаблицаОС()
	
	Возврат "";
	
КонецФункции

Функция ТекстЗапросаТаблица_абс_ОсновныеСредстваРЖД()
	
	Возврат "";
	
КонецФункции

Функция ТекстЗапросаТаблица_абс_СтоимостьОСРЖД()
	
	Возврат "";
	
КонецФункции

Функция ТекстЗапросаТаблица_абс_МеждународныйОСРЖД()
	
	Возврат "";
	
КонецФункции
